import { IHistoricalDatesDate } from '@/types/historicalDatesDateType'

export const historicalDatesDate: IHistoricalDatesDate[] = [
    {
        id: 1,
        text: 'Спорт',
        items: [
            {
                id: 1,
                date: '2014-11-21 11:11:11',
                description: 'Проходят Летние Олимпийские игры'
            },
            {
                id: 2,
                date: '2017-11-21 11:11:11',
                description: 'Команда выигрывает чемпионат по футболу'
            },
            {
                id: 3,
                date: '2020-11-21 11:11:11',
                description: 'Спортсмен устанавливает новый мировой рекорд'
            },
            {
                id: 4,
                date: '2021-11-21 11:11:11',
                description: 'Новый стадион открывается для проведения спортивных соревнований'
            },
            {
                id: 5,
                date: '2023-11-21 11:11:11',
                description: 'Сборная команда становится победителем в международном турнире'
            }
        ]
    },
    {
        id: 2,
        text: 'Бизнес',
        items: [
            {
                id: 6,
                date: '2015-11-21 11:11:11',
                description: 'Запуск успешного стартапа в сфере технологий'
            },
            {
                id: 7,
                date: '2016-11-21 11:11:11',
                description: 'Избрание нового CEO крупной компании'
            },
            {   
                id: 8,
                date: '2018-11-21 11:11:11',
                description: 'Проведение международной конференции по бизнесу'
            },
            {
                id: 9,
                date: '2020-11-21 11:11:11',
                description: 'Открытие нового коворкингового пространства'
            },
            {
                id: 10,
                date: '2022-11-21 11:11:11',
                description: 'Выход на рынок новой инновационной продукции'
            },
            {
                id: 11,
                date: '2023-11-21 11:11:11',
                description: 'Получение крупного инвестиционного финансирования'
            }
        ]
    },
    {
        id: 3,
        text: 'Развлечения',
        items: [
            {
                id: 12,
                date: '2010-11-21 11:11:11',
                description: 'Выход нового блокбастера в кинотеатрах'
            },
            {
                id: 13,
                date: '2012-11-21 11:11:11',
                description: 'Открытие нового тематического парка'
            },
            {
                id: 14,
                date: '2015-11-21 11:11:11',
                description: 'Проведение крупного музыкального фестиваля'
            },
            {
                id: 15,
                date: '2018-11-21 11:11:11',
                description: 'Выход долгожданного сезона популярного телесериала'
            },
            {
                id: 16,
                date: '2020-11-21 11:11:11',
                description: 'Открытие нового игрового центра с виртуальной реальностью'
            },
            {
                id: 17,
                date: '2028-11-21 11:11:11',
                description: 'Релиз новой видеоигры с высокими продажами'
            }
        ]
    },
    {
        id: 4,
        text: 'Здоровье',
        items: [
            {
                id: 18,
                date: '2008-11-21 11:11:11',
                description: 'Открытие нового лекарства для лечения рака'
            },
            {
                id: 19,
                date: '2009-11-21 11:11:11',
                description: 'Открытие нового метода протезирования для людей с ограниченными возможностями'
            },
            {
                id: 20,
                date: '2011-11-21 11:11:11',
                description: 'Разработка вакцины от вируса гриппа с высокой эффективностью'
            },
            {
                id: 21,
                date: '2014-11-21 11:11:11',
                description: 'Открытие нового лечения для заболеваний сердца'
            },
            {
                id: 22,
                date: '2018-11-21 11:11:11',
                description: 'Исследование о взаимосвязи между питанием и здоровьем'
            },
            {
                id: 23,
                date: '2020-11-21 11:11:11',
                description: 'Открытие новых методов лечения психических расстройств'
            },
            {
                id: 24,
                date: '2022-11-21 11:11:11',
                description: 'Исследование о взаимосвязи между питанием и здоровьем'
            },
            {
                id: 25,
                date: '2024-11-21 11:11:11',
                description: 'Открытие новых методов лечения психических расстройств'
            }
        ]
    },
    {
        id: 5,
        text: 'Литература',
        items: [
            {
                id: 26,
                date: '1865-11-21 11:11:11',
                description: 'Фантастическая повесть о приключениях девочки Алисы, которая попадает в волшебную страну'
            },
            {
                id: 27,
                date: '1867-11-21 11:11:11',
                description: 'Роман, повествующий о студенте Раскольникове и его убийстве, а также каре и наказании, которые последуют'
            },
            {
                id: 28,
                date: '1901-11-21 11:11:11',
                description: 'Роман-эпопея, рассказывающий о русском обществе во время войны 1812 года'
            },
            {
                id: 29,
                date: '1949-11-21 11:11:11',
                description: 'Антиутопический роман, описывающий тоталитарное будущее, где правительство контролирует каждый шаг граждан'
            },
            {
                id: 30,
                date: '1966-11-21 11:11:11',
                description: 'Роман, сочетающий различные жанры, рассказывает историю о Сатане, его спутнике и их посещении Москвы'
            },
            {
                id: 31,
                date: '1997-11-21 11:11:11',
                description: 'Приключенческая книга о мальчике-волшебнике Гарри Поттере и его борьбе с силами зла'
            }
        ]
    },
    {
        id: 6,
        text: 'Наука',
        items: [
            {
                id: 32,
                date: '2015-11-21 11:11:11',
                description: '13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды'
            },
            {
                id: 33,
                date: '2016-11-21 11:11:11',
                description: 'Открытие новой планеты в зоне обитаемости вокруг звезды Proxima Centauri'
            },
            {
                id: 34,
                date: '2017-11-21 11:11:11',
                description: 'Обнаружение гравитационных волн, вызванных слиянием двух нейтронных звёзд'
            },
            {
                id: 35,
                date: '2018-11-21 11:11:11',
                description: 'Первое снимок черной дыры с помощью радиотелескопа Event Horizon Telescope'
            },
            {
                id: 36,
                date: '2019-11-21 11:11:11',
                description: 'Опубликованы первые изображения поверхности планеты Меркурий со спутника BepiColombo'
            },
            {
                id: 37,
                date: '2034-11-21 11:11:11',
                description: 'NASA успешно доставила образцы грунта с поверхности астероида Бенну'
            },
        ]
    },
] 